In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.preprocessing import StandardScaler
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score
import datetime as dt
import seaborn as sns

In [3]:
import pandas as pd
from google.colab import files
uploaded = files.upload()

Saving Mall_Customers.csv to Mall_Customers.csv

In [4]:
import io
df = pd.read_csv(io.BytesIO(uploaded['Mall_Customers.csv']))

In [5]:
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [7]:
#Initial Data Exploration-
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [8]:
df.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [9]:
df.shape

(200, 5)

In [11]:
df_cleaned = df.drop(['CustomerID'], axis=1)

In [12]:
df_cleaned.shape

(200, 4)

In [14]:
#Check for Missing values-
df_cleaned.isnull().sum()/df_cleaned.shape[0]

Gender                    0.0
Age                       0.0
Annual Income (k$)        0.0
Spending Score (1-100)    0.0
dtype: float64

In [15]:
#Check for Duplicate values-
df.duplicated()
df.duplicated().sum()

0

In [16]:
df_cleaned.dtypes

Gender                    object
Age                        int64
Annual Income (k$)         int64
Spending Score (1-100)     int64
dtype: object

In [20]:
#Check for invalid values-
df['Spending Score (1-100)'].value_counts()

42    8
55    7
46    6
73    6
35    5
     ..
31    1
82    1
24    1
23    1
99    1
Name: Spending Score (1-100), Length: 84, dtype: int64

In [23]:
#So no invalid values found-
df_cleaned.describe()

              Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000          200.000000              200.000000
mean    38.850000           60.560000               50.200000
std     13.969007           26.264721               25.823522
min     18.000000           15.000000                1.000000
25%     28.750000           41.500000               34.750000
50%     36.000000           61.500000               50.000000
75%     49.000000           78.000000               73.000000
max     70.000000          137.000000               99.000000

In [28]:
col_list = ['Age', 'Annual Income (k$)', 'Spending Score (1-100)']
# Detect outliers in each variable using box plots.
plt.figure(figsize=(20, 7))
 
for i in range(len(col_list)):
                     plt.subplot(1,4,i+1)
                     plt.boxplot(df_cleaned[col_list[i]],whis=1.5)
                     plt.title(col_list[i])
 
plt.show()

In [ ]:
#Have one question in outliers-Do i need to remove them or not?as in if not then they will be assigned to different clusters just

In [30]:
df_cleaned

     Gender  Age  Annual Income (k$)  Spending Score (1-100)
0      Male   19                  15                      39
1      Male   21                  15                      81
2    Female   20                  16                       6
3    Female   23                  16                      77
4    Female   31                  17                      40
..      ...  ...                 ...                     ...
195  Female   35                 120                      79
196  Female   45                 126                      28
197    Male   32                 126                      74
198    Male   32                 137                      18
199    Male   30                 137                      83

[200 rows x 4 columns]

In [31]:
#Encoding categorical variable-
Gender_dummy = pd.get_dummies(df_cleaned['Gender'])

In [32]:
Gender_dummy

     Female  Male
0         0     1
1         0     1
2         1     0
3         1     0
4         1     0
..      ...   ...
195       1     0
196       1     0
197       0     1
198       0     1
199       0     1

[200 rows x 2 columns]

In [33]:
input_df = pd.concat([Gender_dummy, df_cleaned], axis=1)
input_df.head()

   Female  Male  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0       0     1    Male   19                  15                      39
1       0     1    Male   21                  15                      81
2       1     0  Female   20                  16                       6
3       1     0  Female   23                  16                      77
4       1     0  Female   31                  17                      40

In [36]:
#Removing Gender
input_df = input_df.drop(['Gender'], axis=1)

In [37]:
input_df.head()

   Female  Male  Age  Annual Income (k$)  Spending Score (1-100)
0       0     1   19                  15                      39
1       0     1   21                  15                      81
2       1     0   20                  16                       6
3       1     0   23                  16                      77
4       1     0   31                  17                      40

In [ ]:
#K- Means clustering
#Meeting the assumptions-
#cont variables shud have normal distribution and shud be in standard form.Tus no changes needs to be done./

In [38]:
#Fit K-Means-
sse={}
for k in range(1, 21):
    kmeans = KMeans(n_clusters=k, random_state=100)
    kmeans.fit(input_df)
    sse[k] = kmeans.inertia_ 
    
    
plt.figure(figsize=(10,6))
# Add the plot title "The Elbow Method"
plt.title('The Elbow Method')

# Add X-axis label "k"
plt.xlabel('k')

# Add Y-axis label "SSE"
plt.ylabel('SSE')
sns.pointplot(x=list(sse.keys()), y=list(sse.values()))
plt.show()

In [50]:
kmeans = KMeans(n_clusters=5, random_state=1) 
kmeans.fit(input_df)
input_df['cluster_number'] = kmeans.labels_
input_df.head()

   Female  Male  ...  Spending Score (1-100)  cluster_number
0       0     1  ...                      39               4
1       0     1  ...                      81               3
2       1     0  ...                       6               4
3       1     0  ...                      77               3
4       1     0  ...                      40               4

[5 rows x 6 columns]

In [51]:
input_df['cluster_number'].value_counts()

0    79
2    39
1    36
4    23
3    23
Name: cluster_number, dtype: int64

In [52]:
input_df.head()

   Female  Male  ...  Spending Score (1-100)  cluster_number
0       0     1  ...                      39               4
1       0     1  ...                      81               3
2       1     0  ...                       6               4
3       1     0  ...                      77               3
4       1     0  ...                      40               4

[5 rows x 6 columns]